espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Load  Immediate */
#define E_LOAD_IMM(dest, imm11s) DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (EU << 5)
#define E_LOAD_IMMS(dest, imm11s) DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (EU << 5)
#define E_COND_LOAD_IMM(cond, dest, imm11s) DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (cond << 5)
#define E_COND_LOAD_IMMS(cond, dest, imm11s) \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (cond << 5)

/* Load Shifted Immediate */
#define E_LOAD_SIMM(dest, imm11s, sam)                                                                \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (EU << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19)
#define E_LOAD_SIMMS(dest, imm11s, sam)                                                                          \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (EU << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19)
#define E_COND_LOAD_SIMM(cond, dest, imm11s, sam)                                                       \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (cond << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19)
#define E_COND_LOAD_SIMMS(cond, dest, imm11s, sam)                                                                 \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (cond << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19)

/* Load  Inverted Immediate */
#define E_LOAD_IMMN(dest, imm11s) DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (EU << 5) + (1 << 31)
#define E_LOAD_IMMNS(dest, imm11s) \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (EU << 5) + (1 << 31)
#define E_COND_LOAD_IMMN(cond, dest, imm11s) \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (cond << 5) + (1 << 31)
#define E_COND_LOAD_IMMNS(cond, dest, imm11s) \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (cond << 5) + (1 << 31)

/* Load Shifted then inverted Immediate */
#define E_LOAD_SIMMN(dest, imm11s, sam)                                                               \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (EU << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19) + (1 << 31)
#define E_LOAD_SIMMNS(dest, imm11s, sam)                                                                         \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (EU << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19) + (1 << 31)
#define E_COND_LOAD_SIMMN(cond, dest, imm11s, sam)                                                      \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (cond << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19) + (1 << 31)
#define E_COND_LOAD_SIMMNS(cond, dest, imm11s, sam)                                                                \
    DCD 0x0 + (dest << 10) + ((imm11s & 0x7ff) << 20) + (1 << 18) + (1 << 9) + (cond << 5) + ((sam & 0xf) << 14) + \
        (((sam & 0x10) >> 4) << 19) + (1 << 31)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_AHB_READ Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                        opcode    Ptr PostIncrement (0 means pre-inc)   Rdata Dest */
/*                                                        Pointer       WData Source        Offset UpdatePointer */
/*                                                        SizeWord    Signed Access  Cond */

/* LDR (Load, Load Byte, LoadByteSigned) */
#define E_LDR(dest, source, offset8s)                                                                            \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (1 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRB(dest, source, offset8s)                                                                           \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (0 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRBS(dest, source, offset8s)                                                                          \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (0 << 18) + (1 << 21) + \
        (EU << 5)

/* Conditional LDR (Load, Load Byte, LoadByteSigned) */
#define E_COND_LDR(cond, dest, source, offset8s)                                                                 \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (1 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRB(cond, dest, source, offset8s)                                                                \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (0 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRBS(cond, dest, source, offset8s)                                                               \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (0 << 20) + (0 << 18) + (1 << 21) + \
        (cond << 5)

/* With Update Pointer */
#define E_LDR_PRE(dest, source, offset8s)                                                                        \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (1 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRB_PRE(dest, source, offset8s)                                                                       \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRBS_PRE(dest, source, offset8s)                                                                      \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (1 << 21) + \
        (EU << 5)
#define E_COND_LDR_PRE(cond, dest, source, offset8s)                                                             \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (1 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRB_PRE(cond, dest, source, offset8s)                                                            \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRBS_PRE(cond, dest, source, offset8s)                                                           \
    DCD 0x1 + (0 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (1 << 21) + \
        (cond << 5)

