espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* With Update Pointer (Post Increment pointer) */
#define E_LDR_POST(dest, source, offset8s)                                                                       \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (1 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRB_POST(dest, source, offset8s)                                                                      \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (0 << 21) + \
        (EU << 5)
#define E_LDRBS_POST(dest, source, offset8s)                                                                     \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (1 << 21) + \
        (EU << 5)
#define E_COND_LDR_POST(cond, dest, source, offset8s)                                                            \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (1 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRB_POST(cond, dest, source, offset8s)                                                           \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (0 << 21) + \
        (cond << 5)
#define E_COND_LDRBS_POST(cond, dest, source, offset8s)                                                          \
    DCD 0x1 + (1 << 19) + (dest << 10) + (source << 14) + (offset8s << 24) + (1 << 20) + (0 << 18) + (1 << 21) + \
        (cond << 5)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_AHB_WRITE Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                       opcode    Ptr PostIncrement (0 means pre-inc)   Rdata Dest */
/*                                                       Pointer       WData Source        offset8s UpdatePointer */
/*                                                       SizeWord    Signed Access  Cond */

/* STR (Load, Load Byte, LoadByteSigned) */
#define E_STR(raddr, rdata, offset8s)                                                                            \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (0 << 10) + (1 << 18) + (0 << 11) + \
        (EU << 5)
#define E_STRB(raddr, rdata, offset8s)                                                                           \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (0 << 10) + (0 << 18) + (0 << 11) + \
        (EU << 5)

/* Conditional STR (Load, Load Byte, LoadByteSigned) */
#define E_COND_STR(cond, raddr, rdata, offset8s)                                                                 \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (0 << 10) + (1 << 18) + (0 << 11) + \
        (cond << 5)
#define E_COND_STRB(cond, raddr, rdata, offset8s)                                                                \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (0 << 10) + (0 << 18) + (0 << 11) + \
        (cond << 5)

/* With Update Pointer */
#define E_STR_PRE(raddr, rdata, offset8s)                                                                        \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (1 << 18) + (0 << 11) + \
        (EU << 5)
#define E_STRB_PRE(raddr, rdata, offset8s)                                                                       \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (0 << 18) + (0 << 11) + \
        (EU << 5)
#define E_COND_STR_PRE(cond, raddr, rdata, offset8s)                                                             \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (1 << 18) + (0 << 11) + \
        (cond << 5)
#define E_COND_STRB_PRE(cond, raddr, rdata, offset8s)                                                            \
    DCD 0x2 + (0 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (0 << 18) + (0 << 11) + \
        (cond << 5)

/* With Update Pointer (Post Increment pointer) */
#define E_STR_POST(raddr, rdata, offset8s)                                                                       \
    DCD 0x2 + (1 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (1 << 18) + (0 << 11) + \
        (EU << 5)
#define E_STRB_POST(raddr, rdata, offset8s)                                                                      \
    DCD 0x2 + (1 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (0 << 18) + (0 << 11) + \
        (EU << 5)
#define E_COND_STR_POST(cond, raddr, rdata, offset8s)                                                            \
    DCD 0x2 + (1 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (1 << 18) + (0 << 11) + \
        (cond << 5)
#define E_COND_STRB_POST(cond, raddr, rdata, offset8s)                                                           \
    DCD 0x2 + (1 << 19) + (raddr << 14) + (rdata << 20) + (offset8s << 24) + (1 << 10) + (0 << 18) + (0 << 11) + \
        (cond << 5)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                      Stack Operations (built up from E_LDR and E_STR codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

