espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Add imm12s to reg and invert result */
#define E_ADDN_IMM(dest, src1, imm12s) \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_ADDN_IMMS(dest, src1, imm12s) \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ADDN_IMM(cond, dest, src1, imm12s) \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ADDN_IMMS(cond, dest, src1, imm12s) \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)

/* Add reg to reg with Post Shift Left */
#define E_ADD_LSL(dest, src1, src2, shift5)                                                                  \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_ADD_LSLS(dest, src1, src2, shift5)                                                                \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADD_LSL(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_ADD_LSLS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)

/* Add reg to reg and invert result with Post Shift Left */
#define E_ADDN_LSL(dest, src1, src2, shift5)                                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_ADDN_LSLS(dest, src1, src2, shift5)                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADDN_LSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADDN_LSLS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)

/* Add reg to reg with Post Shift Right */
#define E_ADD_LSR(dest, src1, src2, shift5)                                                                  \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_ADD_LSRS(dest, src1, src2, shift5)                                                                \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADD_LSR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_ADD_LSRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)

/* Add reg to reg and invert result with Post Shift Right */
#define E_ADDN_LSR(dest, src1, src2, shift5)                                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_ADDN_LSRS(dest, src1, src2, shift5)                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADDN_LSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADDN_LSRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)

/* Add reg to reg with Post Arith Shift Right */
#define E_ADD_ASR(dest, src1, src2, shift5)                                                                  \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_ADD_ASRS(dest, src1, src2, shift5)                                                                \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADD_ASR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_ADD_ASRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)

/* Add reg to reg and invert result with Post Arith Shift Right */
#define E_ADDN_ASR(dest, src1, src2, shift5)                                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_ADDN_ASRS(dest, src1, src2, shift5)                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADDN_ASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADDN_ASRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)

/* Add reg to reg with Post ROR */
#define E_ADD_ROR(dest, src1, src2, shift5)                                                                  \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_ADD_RORS(dest, src1, src2, shift5)                                                                \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADD_ROR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_ADD_RORS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)

/* Add reg to reg and invert result with ROR */
#define E_ADDN_ROR(dest, src1, src2, shift5)                                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_ADDN_RORS(dest, src1, src2, shift5)                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADDN_ROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADDN_RORS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)

/* Add reg to reg with Flip */
#define E_ADD_F(dest, src1, src2)                                                                                   \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_ADD_FS(dest, src1, src2)                                                                                 \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ADD_F(cond, dest, src1, src2)                                                                          \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_COND_ADD_FS(cond, dest, src1, src2)                                                                        \
    DCD 0x6 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)

