espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Rotate and then ADD */
#define E_ROR_ADD(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then ADD */
#define E_ROR_ADDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then SUB */
#define E_ROR_SUB(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then SUB */
#define E_ROR_SUBS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then ADC */
#define E_ROR_ADC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then ADC */
#define E_ROR_ADCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then SBC */
#define E_ROR_SBC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then SBC */
#define E_ROR_SBCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18)

/* Conditional */
/* Rotate */
#define E_COND_ROR(cond, dest, r2shift, shift5)                                                                \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18)
/* Rotate and Set Flag */
#define E_COND_RORS(cond, dest, r2shift, shift5)                                                               \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18)

/* Rotate and then AND */
#define E_COND_ROR_AND(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then AND */
#define E_COND_ROR_ANDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then OR */
#define E_COND_ROR_OR(cond, dest, roperand, r2shift, shift5)                                                          \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then OR */
#define E_COND_ROR_ORS(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then XOR */
#define E_COND_ROR_XOR(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then XOR */
#define E_COND_ROR_XORS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then ADD */
#define E_COND_ROR_ADD(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then ADD */
#define E_COND_ROR_ADDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then SUB */
#define E_COND_ROR_SUB(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then SUB */
#define E_COND_ROR_SUBS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then ADC */
#define E_COND_ROR_ADC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then ADC */
#define E_COND_ROR_ADCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then SBC */
#define E_COND_ROR_SBC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then SBC */
#define E_COND_ROR_SBCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Arithmetical Shift Codes */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Left/Right
 */
/*                                                         Shift/Rotate  Arith/Shift */

