espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Arith Shift Right */
#define E_ASR(dest, r2shift, shift5)                                                                         \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag */
#define E_ASRS(dest, r2shift, shift5)                                                                        \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (1 << 18)

/* Arith Shift Right and then AND */
#define E_ASR_AND(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then AND */
#define E_ASR_ANDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then OR */
#define E_ASR_OR(dest, roperand, r2shift, shift5)                                                                   \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then OR */
#define E_ASR_ORS(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then XOR */
#define E_ASR_XOR(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then XOR */
#define E_ASR_XORS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then ADD */
#define E_ASR_ADD(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then ADD */
#define E_ASR_ADDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then SUB */
#define E_ASR_SUB(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then SUB */
#define E_ASR_SUBS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then ADC */
#define E_ASR_ADC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then ADC */
#define E_ASR_ADCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18)

/* Arith Shift Right and then SBC */
#define E_ASR_SBC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18)
/* Arith Shift Right and Set Flag then SBC */
#define E_ASR_SBCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18)

/* Conditional */
/* Conditional Arith Shift */
#define E_COND_ASR(cond, dest, r2shift, shift5)                                                                \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag */
#define E_COND_ASRS(cond, dest, r2shift, shift5)                                                               \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then AND */
#define E_COND_ASR_AND(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then AND */
#define E_COND_ASR_ANDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then OR */
#define E_COND_ASR_OR(cond, dest, roperand, r2shift, shift5)                                                          \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then OR */
#define E_COND_ASR_ORS(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then XOR */
#define E_COND_ASR_XOR(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then XOR */
#define E_COND_ASR_XORS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then ADD */
#define E_COND_ASR_ADD(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then ADD */
#define E_COND_ASR_ADDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then SUB */
#define E_COND_ASR_SUB(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then SUB */
#define E_COND_ASR_SUBS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then ADC */
#define E_COND_ASR_ADC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then ADC */
#define E_COND_ASR_ADCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18)

/* Conditional Arith Shift and then SBC */
#define E_COND_ASR_SBC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18)
/* Conditional Arith Shift and Set Flag then SBC */
#define E_COND_ASR_SBCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Flip Opcodes */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Endian/bit
 */
/*                                                         ARITH  Arith/Shift */

/* Flip Endian , ASR Right */
#define E_FEND_ASR(dest, r2shift, shift5)                                                                    \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag */
#define E_FEND_ASRS(dest, r2shift, shift5)                                                                   \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , AND */
#define E_FEND_ASR_AND(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then AND */
#define E_FEND_ASR_ANDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , OR */
#define E_FEND_ASR_OR(dest, roperand, r2shift, shift5)                                                              \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then OR */
#define E_FEND_ASR_ORS(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , XOR */
#define E_FEND_ASR_XOR(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then XOR */
#define E_FEND_ASR_XORS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (1 << 19)

