espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Flip Endian , ASR Right , ADD */
#define E_FEND_ASR_ADD(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then ADD */
#define E_FEND_ASR_ADDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , SUB */
#define E_FEND_ASR_SUB(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then SUB */
#define E_FEND_ASR_SUBS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , ADC */
#define E_FEND_ASR_ADC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then ADC */
#define E_FEND_ASR_ADCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (1 << 19)

/* Flip Endian , ASR Right , SBC */
#define E_FEND_ASR_SBC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (1 << 19)
/* Flip Endian , ASR Right ,Set Flag then SBC */
#define E_FEND_ASR_SBCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (1 << 19)

/* Conditional */
/* Conditional Flip Endian , ASR */
#define E_COND_FEND_ASR(cond, dest, r2shift, shift5)                                                           \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag */
#define E_COND_FEND_ASRS(cond, dest, r2shift, shift5)                                                          \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , AND */
#define E_COND_FEND_ASR_AND(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then AND */
#define E_COND_FEND_ASR_ANDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , OR */
#define E_COND_FEND_ASR_OR(cond, dest, roperand, r2shift, shift5)                                                     \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then OR */
#define E_COND_FEND_ASR_ORS(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , XOR */
#define E_COND_FEND_ASR_XOR(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then XOR */
#define E_COND_FEND_ASR_XORS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , ADD */
#define E_COND_FEND_ASR_ADD(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then ADD */
#define E_COND_FEND_ASR_ADDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , SUB */
#define E_COND_FEND_ASR_SUB(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then SUB */
#define E_COND_FEND_ASR_SUBS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (1 << 19)

