espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Logical Shift and then ADD */
#define E_RLSL_ADDN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_ADDN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then ADD */
#define E_RLSL_ADDNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_ADDNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then SUB */
#define E_RLSL_SUBN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_SUBN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then SUB */
#define E_RLSL_SUBNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_SUBNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then ADC */
#define E_RLSL_ADCN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_ADCN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then ADC */
#define E_RLSL_ADCNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_ADCNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then SBC */
#define E_RLSL_SBCN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_SBCN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then SBC */
#define E_RLSL_SBCNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_RLSR_SBCNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Conditional */
/* Logical Shift */
#define E_COND_RLSLN(cond, dest, r2shift, rshift)                                                              \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSRN(cond, dest, r2shift, rshift)                                                              \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag */
#define E_COND_RLSLNS(cond, dest, r2shift, rshift)                                                             \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSRNS(cond, dest, r2shift, rshift)                                                             \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then AND */
#define E_COND_RLSL_ANDN(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_ANDN(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then AND */
#define E_COND_RLSL_ANDNS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_ANDNS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then OR */
#define E_COND_RLSL_ORN(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_ORN(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then OR */
#define E_COND_RLSL_ORNS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_ORNS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

/* Logical Shift and then XOR */
#define E_COND_RLSL_XORN(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_XORN(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 27)
/* Logical Shift and Set Flag then XOR */
#define E_COND_RLSL_XORNS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 27)
#define E_COND_RLSR_XORNS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 27)

