espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/wlan_bt_ble/wlan_https_bt_a2dp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_smartdma_prv.h
/* Rotate and then ADD */
#define E_ADD_RROR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then ADD */
#define E_ADD_RRORS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then SUB */
#define E_SUB_RROR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then SUB */
#define E_SUB_RRORS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then ADC */
#define E_ADC_RROR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then ADC */
#define E_ADC_RRORS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then SBC */
#define E_SBC_RROR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then SBC */
#define E_SBC_RRORS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Conditional */

/* Rotate and then AND */
#define E_COND_AND_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then AND */
#define E_COND_AND_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then OR */
#define E_COND_OR_RROR(cond, dest, roperand, r2shift, rshift)                                                         \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then OR */
#define E_COND_OR_RRORS(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then XOR */
#define E_COND_XOR_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then XOR */
#define E_COND_XOR_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then ADD */
#define E_COND_ADD_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then ADD */
#define E_COND_ADD_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then SUB */
#define E_COND_SUB_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then SUB */
#define E_COND_SUB_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then ADC */
#define E_COND_ADC_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then ADC */
#define E_COND_ADC_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/* Rotate and then SBC */
#define E_COND_SBC_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 28)
/* Rotate and Set Flag then SBC */
#define E_COND_SBC_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 28)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_ROTATE by Reg Codes and invert ALU result */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Left/Right
 */
/*                                                         Shift/Rotate */

/* Rotate */
#define E_RRORN(dest, r2shift, rshift)                                                                       \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18) + (1 << 27)
/* Rotate and Set Flag */
#define E_RRORNS(dest, r2shift, rshift)                                                                      \
    DCD 0x19 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18) + (1 << 27)

/* Rotate and then AND */
#define E_RROR_ANDN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 27)
/* Rotate and Set Flag then AND */
#define E_RROR_ANDNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 27)

/* Rotate and then OR */
#define E_RROR_ORN(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 27)
/* Rotate and Set Flag then OR */
#define E_RROR_ORNS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 27)

/* Rotate and then XOR */
#define E_RROR_XORN(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 27)
/* Rotate and Set Flag then XOR */
#define E_RROR_XORNS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 27)

